{
  "call_date": "2024-07-05",
  "call_title": "Weekly Update & AMA - July 4th 2024",
  "decisions": [
    {
      "id": 1,
      "timestamp": "13:13",
      "decision": "Sigmanauts will spend about five grand on merchandise including shirts, long sleeve sweats, stickers with the classic blue Ergo logo, and 100 red hats with 'make mining great again' text",
      "speaker": "qx()",
      "context": "Planning merchandise for RareEvo event",
      "topic": "sigmanauts",
      "significance": "minor",
      "quote": "We want to spend about five grand on shirts, long sleeve sweats, on stickers with the classic, blue cool... we're making stickers of that and then we're gonna make a hundred hats that now bear with me here. They're red hats... With white writing on the back, it says Ergo... But on the front, two lines of text, it says make mining great again."
    }
  ],
  "commitments": [
    {
      "id": 1,
      "timestamp": "12:03",
      "commitment": "Bring merchandise to RareEvo if the vote passes",
      "owner": "Sigmanauts",
      "timeline": "RareEvo event",
      "topic": "sigmanauts",
      "quote": "So we're going to bring that to RareEvo if the vote passes."
    },
    {
      "id": 2,
      "timestamp": "12:25",
      "commitment": "Set up a pop-up site for selling leftover merchandise inventory",
      "owner": "Sigmanauts",
      "timeline": "unspecified",
      "topic": "sigmanauts",
      "quote": "the plan is to kind of spin off some whatever inventory's left, perhaps put up a little pop-up site that people can buy that."
    },
    {
      "id": 3,
      "timestamp": "12:36",
      "commitment": "Integrate mine for merch functionality allowing mining directly for physical merchandise",
      "owner": "Mark the Shark/Sigmanauts mining pool",
      "timeline": "unspecified",
      "topic": "mining",
      "quote": "we may integrate like mine for merch. So you point your mining rig to a separate wallet that is like the hat or the shirt and you mine and after a time when your amount gets up to what the price of the product is, you know, you shut off your miner turn it back to you know, the token or the coin and you get shipped the hat automatically or the shirt automatically"
    },
    {
      "id": 4,
      "timestamp": "34:57",
      "commitment": "Keep everyone updated on fiat on-ramp integration progress",
      "owner": "qx()",
      "timeline": "ongoing",
      "topic": "integration",
      "quote": "I'll keep everybody updated on that as it comes... I think it's better if it's all out on the table and you guys are aware whether it's gonna happen or not gonna happen as it happens, so I'll keep you guys posted on that kind of thing."
    }
  ],
  "open_questions": [
    {
      "id": 1,
      "timestamp": "34:41",
      "question": "Requirements, costs, and developer time needed for fiat on-ramp integration",
      "context": "Investigating non-KYC fiat on-ramp integration with a swap site",
      "topic": "integration",
      "raised_by": "qx()"
    }
  ],
  "reversals_or_updates": [],
  "key_facts": [
    {
      "id": 1,
      "timestamp": "00:42",
      "fact": "Ergo is celebrating its fifth birthday",
      "speaker": "mgPai",
      "topic": "milestone"
    },
    {
      "id": 2,
      "timestamp": "04:45",
      "fact": "Alephium mainnet launched in 2021, making it newer than Ergo",
      "speaker": "mgPai",
      "topic": "blockchain-comparison"
    },
    {
      "id": 3,
      "timestamp": "18:20",
      "fact": "Drinking age in Greece is 18, in Japan it's 20",
      "speaker": "mgPai",
      "topic": "general"
    },
    {
      "id": 4,
      "timestamp": "19:16",
      "fact": "Radix announcement involves ASICs manufacturer called 'the entity' that will have over 50% hash rate and give 10% of rewards back to Radix community",
      "speaker": "qx()",
      "topic": "blockchain-news"
    },
    {
      "id": 5,
      "timestamp": "22:29",
      "fact": "Ergo's DAG table size hit over four gigabytes last month, cutting out older mining cards",
      "speaker": "qx()",
      "topic": "mining"
    },
    {
      "id": 6,
      "timestamp": "25:26",
      "fact": "ZenGate team size is maybe 10-20 people, not all full time",
      "speaker": "mgPai",
      "topic": "zengate"
    },
    {
      "id": 7,
      "timestamp": "48:33",
      "fact": "Kaspa recently launched KRC20 tokens",
      "speaker": "mgPai",
      "topic": "blockchain-news"
    }
  ]
}